www/templates/Search Delivery.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="urn:localhost-paint" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns2="http://xml.apache.org/xml-soap" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
	<SOAP-ENV:Body>
		<ns1:handleRequest>
			<contextId xsi:type="xsd:string">01234567890</contextId>
			<className xsi:type="xsd:string">bus_facade_campaign_delivery</className>
			<processName xsi:type="xsd:string">search</processName>
			<entityData xsi:type="ns2:Map">
				<item>
					<key xsi:type="xsd:string">deliveryStatuses</key>
					<value SOAP-ENC:arrayType="xsd:string[6]" xsi:type="SOAP-ENC:Array">
						<item xsi:type="xsd:string">COMPLETED</item>
						<item xsi:type="xsd:string">PENDING</item>
						<item xsi:type="xsd:string">PENDING_APPROVAL</item>
						<item xsi:type="xsd:string">REJECTED</item>
						<item xsi:type="xsd:string">PROCESSING</item>
						<item xsi:type="xsd:string">PAUSED</item>
					</value>
				</item>
			</entityData>
			<processData xsi:type="ns2:Map"/>
		</ns1:handleRequest>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>



